from datetime import datetime

import pandas as pd
from pytest import fixture


@fixture
def transactions():
    data = [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -160.89,
            "Валюта операции": "RUB",
            "Сумма платежа": -160.89,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 01:20:42",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -100,
            "Валюта операции": "CNY",
            "Сумма платежа": -100,
            "Валюта платежа": "CNY",
            "Кэшбэк": "nan",
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": 5,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 100,
        },
        {
            "Дата операции": "31.12.2021 16:42:04",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -64.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -64.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 64.0,
        },
        {
            "Дата операции": "31.12.2021 16:39:04",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -118.12,
            "Валюта операции": "RUB",
            "Сумма платежа": -118.12,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Наличные",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 118.12,
        },
        {
            "Дата операции": "31.12.2021 15:44:39",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -78.05,
            "Валюта операции": "RUB",
            "Сумма платежа": -78.05,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Переводы",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 78.05,
        },
    ]
    return data


@fixture(
    params=[
        (123, "Дата должна быть строкой"),
        ("", "Дата не может быть пустой"),
        ("20-01-24", "Некорректный формат даты"),
    ]
)
def get_date_interval_fixture(request):
    return request.param


@fixture(
    params=[
        (123, "M", "Дата должна быть строкой"),
        ("", "M", "Дата не может быть пустой"),
        ("20-01-24", "M", "Некорректный формат даты"),
        ("2021-03-01 17:05:00", "X", "Некорректный диапазон. Используйте W, M, Y или ALL."),
    ]
)
def get_date_interval_events_fixture(request):
    return request.param


@fixture(params=[(9, "Доброе утро"), (13, "Добрый день"), (18, "Добрый вечер"), (4, "Доброй ночи")])
def get_greeting_fixture(request):
    return request.param


@fixture(
    params=[
        (
            "2021-03-15 17:05:00",
            "M",
            (
                datetime.strptime("2021-03-01 17:05:00", "%Y-%m-%d %H:%M:%S"),
                datetime.strptime("2021-03-15 17:05:00", "%Y-%m-%d %H:%M:%S"),
            ),
        ),
        (
            "2021-03-15 17:05:00",
            "W",
            (
                datetime.strptime("2021-03-15 17:05:00", "%Y-%m-%d %H:%M:%S"),
                datetime.strptime("2021-03-15 17:05:00", "%Y-%m-%d %H:%M:%S"),
            ),
        ),
        (
            "2021-03-15 17:05:00",
            "Y",
            (
                datetime.strptime("2021-01-01 17:05:00", "%Y-%m-%d %H:%M:%S"),
                datetime.strptime("2021-03-15 17:05:00", "%Y-%m-%d %H:%M:%S"),
            ),
        ),
    ]
)
def get_date_interval_events_fixture_pos(request):
    return request.param


@fixture
def transactions_data():
    return [
        {"Дата платежа": "15.03.2024", "Категория": "Продукты", "Сумма платежа": 5000},
        {"Дата платежа": "20.03.2024", "Категория": "Транспорт", "Сумма платежа": 2000},
        {"Дата платежа": "25.03.2024", "Категория": "Продукты", "Сумма платежа": 3000},
        {"Дата платежа": "01.04.2024", "Категория": "Развлечения", "Сумма платежа": 4000},
    ]


@fixture
def investment_bank_data():
    return [
        {"Дата операции": "2025-03-10", "Сумма операции": 450, "Описание": "Оплата услуг"},
        {"Дата операции": "2025-03-15", "Сумма операции": 1200, "Описание": "Перевод Иван И."},
        {"Дата операции": "2025-03-20", "Сумма операции": 999, "Описание": "Покупка в магазине"},
    ]


@fixture(params=[0, 1])
def investment_bank_fixture(request, investment_bank_data):
    test_cases = [("2025-03", investment_bank_data, 500, 351), ("2025-04", [], 500, 0)]
    return test_cases[request.param]


@fixture(params=[0, 1, 2])
def investment_bank_fixture_error(request, investment_bank_data):
    test_cases = [
        ("2025", investment_bank_data, 500, 0.0),
        ("2025-04", investment_bank_data, "500", 0.0),
        ("2025-04", {}, 500, 0.0),
    ]
    return test_cases[request.param]


@fixture
def search_word_fixture():
    data = [
        {"Описание": "Перевод +7 987 65-43-21"},
        {"Описание": "Оплата Василий П."},
        {"Описание": "Оплата Петр В."},
        {"Описание": "Метро Санкт-Петербург"},
        {"Описание": "Метро Мск"},
    ]
    return data


@fixture
def start_date():
    return datetime.strptime("2021-12-01 16:44:00", "%Y-%m-%d %H:%M:%S")


@fixture
def end_date():
    return datetime.strptime("2021-12-31 16:44:00", "%Y-%m-%d %H:%M:%S")


@fixture(params=[0, 1, 2, 3])
def filtered_transactions_fixture(request, transactions, start_date, end_date):
    test_cases = [
        (transactions, start_date, end_date, 5),
        ([], start_date, end_date, 0),
        (transactions, "", "", 0),
        (
            [{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021"}],
            start_date,
            end_date,
            0,
        ),
    ]
    return test_cases[request.param]


@fixture(
    params=[
        ([], pd.DataFrame()),
        ([{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021"}], pd.DataFrame()),
        (
            {
                "Дата операции": "31.12.2021 01:23:42",
                "Дата платежа": "31.12.2021",
                "Номер карты": "*5091",
                "Сумма операции": 0,
                "Валюта операции": "RUB",
                "Сумма платежа": 0,
                "Валюта платежа": "RUB",
            },
            pd.DataFrame(),
        ),
    ]
)
def transaction_exchange_error_fixture(request):
    return request.param


@fixture(params=[0, 1])
def card_sum_cashback_fixture(request):
    test_cases = [
        ([], None, 0.0, 0.0),
        ([{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021"}], None, 0.0, 0.0),
    ]
    return test_cases[request.param]


@fixture(params=[([], []), ([{"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021"}], [])])
def cards_info_key_error_fixture(request):
    return request.param


@fixture
def mock_transactions():
    return [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -160.89,
            "Валюта операции": "RUB",
            "Сумма платежа": -160.89,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "31.12.2021 01:20:42",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -100,
            "Валюта операции": "CNY",
            "Сумма платежа": -100,
            "Валюта платежа": "CNY",
            "Кэшбэк": "nan",
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": 5,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 100,
        },
    ]


@fixture
def mock_user_settings():
    return {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "GOOGL"]}


@fixture
def mock_exchange_rates():
    return {"USD": 90.0, "EUR": 98.5}


@fixture
def mock_stock_prices():
    return {"AAPL": 150.0, "GOOGL": 2800.0}
